{"pages":[{"url":"http://kalua.im/blog/pages/about.html","text":"تحت الإنشاء","tags":"pages","title":"عن خالد"},{"url":"http://kalua.im/blog/pages/workstation.html","text":"تحت الانشاء","tags":"pages","title":"محطة عملي (أجهزتي)"},{"url":"http://kalua.im/blog/pages/contact.html","text":"بإمكانك التواصل معي من خلال الطرق التالية: الرسائل الفورية: تلغرام Telegram : من خلال الرابط ( https://telegram.me/kaluaim ) او عن طريق البحث عن kaluaim . هانق اوتس Hangouts : من خلال البحث عن kaluaim . البريد الالكتروني: يمكنك إرسال البريد الإلكتروني مباشرة إلى: k... @gmail.com ولتشفير رسالتك بإمكانك استخدام مفتاحي العمومي ( https://keybase.io/kaluaim/key.asc ) او لتسهيل عملية التشفير بإمكانك استخدام هذا الرابط ( https://keybase.io/encrypt#kaluaim ). نسخة موقّعة من طرق التواصل في هذا الرابط ( http://kalua.im/contact.txt )","tags":"pages","title":"تواصل معي"},{"url":"http://kalua.im/blog/podcasts-2.html","text":"قبل 3 سنوات تقريبا كتبت تدوينة عن البودكاست الذي أتابعه، بعضهما توقف وبعضهم توقفت أنا عن متابعته بسب أنه أصبح لايهمني أو لأي سبباً آخر، وبعضهم مستمر حتى الآن على متابعتها بالإضافة إلى مجموعة من جديد البودكاست. من قناة Revision3 Hak5 بودكاست اسبوعي يهتم بأمن المعلومات وشروحات للبرامج الخاصة بها بالإضافة لتغطيات مؤتمرات أمن المعلومات. Threat Wire نشرة اسبوعية تهتم بقضايا أمن المعلومات والخصوصية المتعلقة بالانترنت. HD Nation بودكاست اسبوعي يهتم بالترفية المنزلي والأجهزة المتعلقة بها. Foundation بودكاست يقدمة كيفن روز يتحاور فيه مع أصحاب الأعمال (entrepreneurs). Film State بودكاست اسبوعي يهتم بجديد السينما. The Ben Heck Show بودكاست اسبوعي يقدمه Ben ويقوم فيه ببناء مشاريع إلكترونية مختلفة. Annie's Bits بودكاست اسبوعي خفيف تستعرض فيه Annie أهم الأحداث من Revision3 بشكل خاص ومن الأنترنت بشكل عام. On The Verge برنامج حواري (Talk Show) يقدمة Joshua Topolsky الشريك المؤسس لشبكة The Verge. Top Shelf بودكاست يستعرض العديد من المنتجات المختلفة. 90 SECONDS ON THE VERGE بودكاست يومي مميز يستعرض خلال 90 ثانية أهم الأحداث. (للأسف لم أجد رابط للبودكاست في أيتونز مع أني متأكد أنه موجود سابقاً) أتابع TWiT بشكل متقطع بإستخدام البرنامج الخاصة بهم على الماك، لكن البودكاست التالي هو البرنامج الوحيد الذي أتابعة بشكل منتظم. Before You Buy بودكاست يستعرض مجموعة مختلفة من الأجهزة والمنتجات ويقوم مجموعة من الأشخاص بتجربتها وعرض إنطباعاتهم عنها وإعطاء الإيجابيات والسلبيات لكل منتج.","tags":"misc","title":"بودكاست ٢"},{"url":"http://kalua.im/blog/pretty-good-privacy.html","text":"قد لايهمك التنصت أو التجسس الذي يحدث من قبل وكالة الأمن القومي الأمريكية ( NSA ) لاي سبب من الأسباب! لكن من الجيد معرفة أن هناك طرق تستطيع من خلاله حماية خصوصيتك، سواء في تصفحك، مراسلتك و غيرها... من طرق المراسلة الآمنة، إستخدام \" خصوصية جيد جدا \" ( Pretty Good Privacy ) أو كاختصار(PGP). ببساطة (PGP) هو برنامج يقوم بتشفير الرسائل المرسلة إليك بإستخدام مفتاحك العمومي ( public key ) قبل إرسالها إليك، وبإستخدامك لمفتاحك الخاص ( private key ) يمكنك فك التشفير والإطلاع على الرسالة. هناك برامج PGP كثيرة، شخصياً استخدم إضافة Mailvelope لبساطتها وسهولة إستخدامها وتعاملها المباشر مع مزودي خدمة البريد الإلكتروني الشهيرة مثل (Gmail) و(Yahoo) و(Outlook.com). هناك خطوات أساسية يجب عملها حتى نتمكن من أستخدام مثل هذا البرامج تركيب البرنامج أو الإضافة (برنامج Mailvelope حاليا يدعم كروم وقريبا فايرفوكس) وتوليد المفاتيح الخاصة بك ( مفتاح عمومي و مفتاح خاص ) و خطوة إختيارية هي إضافة مفتاحك العمومي في خادم للمفاتيح (Key Server) مثل ( MIT PGP Public Key Server ) أو ( SKS OpenPGP Key server ) أو غيرهم حتى يتمكن الجميع من مراسلتك بطريقة آمنة. إضافة Mailvelope تقدم لك إمكانية توليد مفاتيح خاصة بك أو إستيرادها في حالة كانت لديك مفاتيحك الخاصة. مهم جداً الإنتباه بأن المفتاح العامومي ( public key ) هو الذي يتم نشرة وأن المفتاح الخاص ( private key ) يتم حفظه بسرية. مفتاحي العامومي ( public key ) -----BEGIN PGP PUBLIC KEY BLOCK----- Version: Keybase OpenPGP v2.0.53 Comment: https://keybase.io/crypto xsFNBFdeSIsBEAC5qtJnwJQ6LZGjm1V+qvc44aW21bs2z7JdvtERfkErC8Jejkgs M/PDcJ18LbqecTCjGk4ftr3DgS9vcxucAPGkbMz92XoJSQ9USonCSpifNYWnPtE3 Kofeu6y8LiWt5AJOzEZ1d9FyHcDAlf6SikJspVaQpSsftcaL5Pxi86iGoVUtnOio 4GrebOZmFC9cFu8YPi9uBHyy6OSROXVv+gQx4zVD0M3DgfD/nDvf7u3Gtyx7tLmb 9T+F7cXcOGD0ej6UUMofByKwW33JTsPcz5tDdR8pnprnlBAsfN2E9w5ybvo3nQWJ pRaop3KWNUFG/80xjfVRMGam6gPHIVt6CY0tpdvJ/YP+IEKzL6nA7Rd3UX1zmtms PekX3AALk7sNpCot9701glXWzhN3qxy79TdFzY3Gu0lMj4NYJQWsVASDLidtDrIk g71yHHkua4ecLin8tMd/LxNOtLkVEP6uToJllBrXS90hKq5EtsV2qUD0azsyuexV VL2NzN9SScYR0fURNjqLZH948hDnGRzs7zB+METxnoUMJLc/Wb3dqPLTbVt1AieA CRgglCFlUBbMQZxMYTZQ2XI3ZTw7q34tN4iqYgKJvchjEGwVRvXHzBniJguC6C0v j1ePD2rHlRpII9TFrWfoSl7o0e8fu1y/fOa8ysB+ipgn3pYMUKdjCHh0/QARAQAB zSJLaGFsaWQgQWxudWFpbSA8a2FsdWFpbUBnbWFpbC5jb20+wsF0BBMBCgAeBQJX XkiLAhsDAwsJBwMVCggCHgECF4ADFgIBAhkBAAoJEM+XVbRG/5jCLLEQAISWjsZK gkGNm98bD3lz7ueszryvzvTllvkZ/d327CDq85oabHpHqbD5pBJAQEvpamgvZlwR Vi9+inUOnD3/S9cyHvqnlkuUtn8WZYIDhoJPh6dPfxVa49gX5HY9XkgW3tMusfJM Lp79QRPPfrwkcItJJJ5ntrSZWXRMvgNHU+wRfrOoNNUDD75EoKGvNuz3EBp643uE j8YNqPZ6mJHJFIkXq1SJL5Ruaa6NTepQUDdqkmCKew7QoeQiVozv/iarCUC7ZI5Q 7UDKsKcdE53bJIi6lzVxTjnPUdYSTS/c4CyHSEiFj6tYNz4PKQjjkU7I3AYv+YE+ BiTZ6UqYEnopjooS7PhXOl+1Jz1GfqIyr8I4HL7e7rEj5GjILMHZ26XKsBZ8ExUh H5Z/eGa6oEQ0Km2PFgVKzuUSdmPUI+hAGfY/9zBRS/uNDZQ/XXJPNY2Qen6zcLWt T1H124VrSyNBvvV7lbaMJVzkx8oNMpCKN93DSR+o07EUkQrCojiJPFQ0oBl6VQ9D APATSe55EZhWGVVV3rYGfdHN/H5qtsl+r7cgGUhBvoE6LrrpC2jlHKkMEPUbfgay j1XYy/IsjqvwbTyubP47FEbdgsttIzg/coneiPv+WSIdMCOUsJjtwx5odO65q+0h olaA0LbqSzzbtvVTAc9pPpAc5WFkYMspa2CJzsBNBFdeSIsBCADAdQw8Ei2/4k9R 94gKu/42K8FHkYrfeXTp/gGkzbmKooWhF7gD/LoaUhFwLAGJt7eSABXctqyG0Q2q FWnU0XzNMAFwTA6xj453cczyriQR5WGzuIULaDEOEFdH6kAy7L8losEFnkcIyumJ hFVtJAvRJnhgUT9tfPsGcoTEsv2X4ZLvsBLMIjafHiYXeZgwtPXsqC9rSD270Ql9 nSXnZS7xkeAd5TN+psPl8eVvMOtpSQgKwBvDSYoIZZW9aGSJoNo/ET1qpgKHhHyc YCYSpwfg8gQzCHbkBBDZaukwA+pHyKCi1yW5q6AD6JhUrb3hfo1CLA5rWWd4kiLi /LPgvRi3ABEBAAHCwoQEGAEKAA8FAldeSIsFCQ8JnAACGwwBKQkQz5dVtEb/mMLA XSAEGQEKAAYFAldeSIsACgkQdkYzk4qsaWozCgf+OdnjqBnerK9o2ZbH99OKtp/b J4+F9sK81Y5/dgyqdWDNIpz6cduAqMJRW8Dmv1fNFLjga9/ljmgOk6yXNyN2zQy+ wjA2BUaLJNGYGIRNmtzL/6MqctwhuTTlJ4kjUs+6x9PhltpDctQAISYCJfICHY5U B14MS8r9ZXg0NczDGk8vuHJ0kEaHs2z5s77UCGwyadYjVTCNQlROR8EX+WtO6Lmj 3nl7tuf5dfF9km3aJnNpyBP3rjeD/OHNG5tbmtk4/9Ktwz/3QTIue16jH/o4rYOn 05/db0ubVWLKKTDDyiEBjdiM2YWhEZlxxsHXMKRgoRWwgZflIEQFS2FP5FJxuZD7 EACmHqEMlcZdmvAjiCSwUTNWFvhCeeuGcA7PEeYw2zAuT3rP3KeJJjI/lSo8HqkX iv6Q00CrqNIOWIwiqaUwgztWg+TEDxESXAjCRMiGd2J4KexfzrsAFodhSLstpIwm DudIKQMJgEKOFARIwzteXFUhd0trTE4uHW7i6GFAETrYA+4OEjKL2h5mlsjm/LOu 31LD+FdX/LrJk/d7oVTLETR2XoRP2spNWnLyOo93u+3qgAnsUyS10gLqHAwzNQIo hDKst151lx4xa5o2DjcnerhtGxsePwB42+Jt5ZbQYFpM2A+gArzwJUjAvmU5dddy ijG0xY+rex8Wf2wSnuZGAYwAVPxBsfMk350+TkXpVJVVLeaUt/kk/LWxfV7cO/Hc Maz8KaK23DgK7yVwPTRN2zPCKMKT/HJDEVTw1FEXSfWl3nmUKJBBulbUES99wZU9 h0OWsdcHUd5kvy9zQLe3I7AXSDRoE2ZT7tpRVn7dFaQltw2nsIk9issJIq1vsa6G DwHDOZ9GGq7rSb0DutwRbJET8IAg/DeRQ38jPmbTyRnIAlnw1f4vJKziVXX9iYR9 /K6CSfT+fVs+h1Q4RpV/XcM4NGvwmohBq0GRmoJ561cso9k5kE6+bDkAdBoo+nlh d5lGhEHFV18c1MUoum5CwO+5EP1UZOkon6jfVpqbnZz0Bs7ATQRXXkiLAQgA0Pch 9NL7LOfLPGLcivwaKRMc/A3h6GDsh84ma3xT83h503DWO7diuIzWL/7I/eMxZL7q 0OLNbYkux9lKHbt0VVx9Gs0BLTC8BsQaj85DBrZkEPdEP59bz8BOVTWgYsZpQOeV DteSGtEl5QDgUdBNvx1NpCl3H2ok48Q0QrAwT2mnCl2mfzn47k05e5S17uv0XiBM XuGpCu4M8mdW34avApTF9VTfZRUcTCMPumtNB5ckd28qQerehUYRPUNZ2iPQuVuY H/zaqViRxTWqFYAvPXt3aaTfYFyDzSs9SGw17E6SFUUlu5DSaH5krUXqUmBOn5YX Ytu1RMqMOk6GoTWc3QARAQABwsKEBBgBCgAPBQJXXkiLBQkPCZwAAhsiASkJEM+X VbRG/5jCwF0gBBkBCgAGBQJXXkiLAAoJEAmsxDlVhmtgqF0IAL3PUINjyTGKz8NU qNjg/bqcrLFITeUbWpQsEcN1hq0hzuvxuuCCrb2Gx/Xb/sE9RdBSqqLDYwmIhc35 V0ndqoXTD2uy5XbPdWTMF+PrOnEQk90UGqGGqUAz9fX4I5t/0c/vN87eHeT2aKCn vF5fUpGFMd7gDDFzGvD8vXcunXdg/6iaoKcvfH8jD4ORTM9fMQ5qeXK/ctQI63Rf VX18YkwSBZt1iwPor4/noErv75Fyr3H553eFFOmZRBqGEZ5V0itLsZSF5KyT4mNj P8Xrbllq7DkfF/YXXJ32UEm+H5EvVQHWEluLZl/3iSHGz6u+C2x84aI3NKaFoxKX ZqnHzPoa/w//ZpKDas1FdaTzkjWaJcUar2hn/AHEbAtozDGTQsWTIEpl+JC4CV+B Kcnlw+rVmJzViUuO0vstv6vSgX69ZL24058oYYQmTaLx1iGVvKDOX0+ZD1Djq6Fl VIYaDz3BUgKa6HPan1/nRALTNa0gLkjql9qbrlZ+ERf2bgjQEsw2Qt2KXjGqWJFX ZUh03hTU4x6aI570LVos6aoaT6vKNA1fVQ0DCEPMYhmgZIpnP26ersaMfDgemyj1 tvkRHaZC5lweQi+15Z6uv+GdzoRvvHEskDsSu6AhBH4bMJkMc3QpkWxd3a49lODv AXuEHUClrMiHElR7qTeB1Nusk4CEfH5EP9PKXVnnrSjoal8V/v4pOK3SVIcYEQF0 W+UPxO0qPwwOk0eOFwgbK9MXxSSi9GpR3QYK6Q/ZvASqZ/qbFfwm5twQzbDCWksA YMGcR3Jdg43TSNKoaEJyANDO8XvGjCpR/mLyjNKwVAYswX4XJKDK4t/5rrzVgfgA RA+jYIe4jcBk/9Co945+xRWhey3hxxGy5zAIzkh8Ju1N8Hu1k3gxHoIpPWZrap9G rWi/q2bn/Fgsubtiq4pZsf85rE4wEwBtwFI2Ce+4wsT/zrMtqn4QqV1iw7cC2UVe 4W8423fYn2gvV0JFKpGRW2LePrzbf4+GJWzCGKeXFYQv6D4MzQnb1s0= =G+3F -----END PGP PUBLIC KEY BLOCK----- الموقع الرسمي لإضافة Mailvelope يقدم شرح ممتاز لكيفية إستخدام الإضافة والتعامل معها. وايضا فيديو من lifehacker يشرح بشكل سريع استيراد المفتاح واستخدام الإضافة. فيديو آخر من hak5 يشرح بشكل مفصلة إضافة Mailvelope (الشرح يبداء من الدقيقة 5 تقريباً) حقوق الصورة","tags":"misc","title":"خصوصية جيد جدا"},{"url":"http://kalua.im/blog/earth-hour-2010.html","text":"هذه السنه هي السنه الأولى التي تشارك فيها السعودية بشكل رسمي في هذا الحدث العالمي، وحدث هذه السنه سيكون في يوم 27 مارس الموافق 11 ربيع الثاني هو السبت الاخير من شهر مارس (الموعد السنويي لهذا الحدث)، وتكون ساعة الارض من الساعة 8:30 – 9:30 حسب التوقيت المحلي للدولة. لمزيد من المعلومات عن ساعة الارض يمكنك زيارة: الموقع الرسمي للحدث أو الموقع الرسمي للحدث في السعودية أو تدوينتي للعام الماضي عن الحدث .","tags":"misc","title":"ساعة الأرض  ٢٠١٠"},{"url":"http://kalua.im/blog/firefox-addons-3.html","text":"المجموعة الثالثة من إضافات الفايرفوكس، ( إضافات الفايرفوكس 1 ، إضافات الفايرفوكس 2 ) . جميع الإضافات في هذا البوست متوافقة مع النسخة الاخيرة 3.6 1 Personas إضافة من نفس الشركة المطورة للفايرفوكس، تتيح الاضافة اكثر من 30.000 ثيم بإمكانك التغيير بينهم بسهولة بدون إعادة تشغيل للمتصفح. 2 Google Wave تبين لك الإضافة الويفات الجديدة على (Google Wave) الخاص بك. 3 Easy YouTube Video Downloader تتيح لك تحميل مقاطع اليوتيوب باكثر من صيغة، الاضافة تضيف بشكل تلقائي ازرار التحميل اسفل وصف المقطع في اليوتيوب. 4 Download Statusbar تظهر الإضافة شريط اسفل المتصفح يبين التحميلات الحالية، الاضافة شبيها بفكرة شريط التحميل بمتصفح كروم. 5 Faviconize Tab مهمة الإضافة تصغير التاب ليحتوي فقط Favicon الخاصة بالموقع، طريقة عملها رايت كلك على التاب المراد تصغيره وبعدها FaviconizeTab .","tags":"misc","title":"إضافات الفايرفوكس ٣"},{"url":"http://kalua.im/blog/helvetica.html","text":"عام 1957 تم تصميم وابتكار خط Helvetica على يد المصممين ماكس ميدينير (Max Miedinger) و إدورد هوفمان (Eduard Hoffmann). ولمدة تزيد عن خمسين سنة يظل هذا الخط من اشهر الخطوط التي قد تصادفها في اي مكان (لوحة ارشادية، شعار لشركة، غلاف مجلة، ...). وخلال هذا المدة حصل الخط على تحديثات عديدة وآخر تحديث كان في هذا العام (2009). لمزيد من المعلومات ويكيبيديا The Font Helvetica لتحميل الخط الاصلي بالإضافة إلى تحديثين له. Helvetica Film بعيد الميلاد الخمسين لهذا الخط اصدر المخرج قاري هوستوي ( Gary Hustwit ) فيلم Helvetica ،وهو فلم وثائقي يتحدث عن نشأة الخط ومعلومات عنه، بالإضافة إلى حوارات مع مصممين يتحدثون عن تجربتهم معه.( الموقع الرسمي للفيلم ) (الفيلم في ايتونز ، IMDb تورنت ) Helvetica script سكربتات يتم تركيبها على المتصفح (فايرفوكس، سفاري، كروم، اوبرا) تغير تصميم الواجهة الخاصة بالمواقع التالية وتعتمد على خط Helvetica. (للتفاصيل وطريقة التركيب قم بزيارة الموقع الخاص بكل سكربت عن طريق الضغط على صورته). Helvetireader Helvetical Helvetimail Helvetwitter Helvetica and Arial Helvetica and Arial من الخطوط الشبيه لخط Helvetica هو خط Arial ومن هنا تظهر بعض الفروقات بين الخطين . Helvetica Wallpaper للحجم الأصلي اضغط على الصورة للحجم الأصلي اضغط على الصورة","tags":"misc","title":"هلفتيكا"},{"url":"http://kalua.im/blog/service-sites-2.html","text":"بوست جديدة تابع لسلسة مواقع خدمية .. في هذا البوست سأطرح خمسة مواقع خدمية 1 ذكرت في البوست السابق عن موقع User Name Check ، هذا الموقع يقوم بنفس الوظيفة لكن بمواقع اكثر! 2 Is This Down اذا كان هناك عطل في موقعك ، يقوم الموقع بالتأكد هل هذا العطل لديك فقط ام لدى الجميع . 3 يحتوى على اليوزر والباسورد الافتراضي لعدد كبير من الراوترات . 4 يوزارت يساعدك للحصول على يوزر للمنتديات التي تطلب التسجيل لمشاهدة المحتوى ، بإمكانك المشاركة بإضافة منتديات جديدة . 5 من اشهر المواقع التي تقدم خدمة قياس سرعة اتصالك .","tags":"misc","title":"مواقع خدمية  ٢"},{"url":"http://kalua.im/blog/podcasts-1.html","text":"البودكاست بإختصار عبارة عن سلسلة من الوسائط سواء كانت صوتية أو مرئية ، يتم تحميلة إلى برامج خاصة بالبودكاست (مثلا iTunes ) تلقائياً بعد الإشتراك في هذه السلسلة. للمزيد . وأصل كلمة Podcast هي دمج بين كلمتي iPod و Brodcast من أفضل الطرق برأيي للبحث عن البودكاست هي من خلال iTunes بسبب تنظيمة وتقسيماته العديد بالاضافة لسهولته . هدف هذه التدوينة هي عرض بعض من افضل البودكاست التي اتابعها ، ومن افضل القنوات التي تقدم Podcasts رائعة سواء بالفكرة او بالتقديم والاخراج هي قناة Revision3 . وسأذكر ستة من البودكاست التي اتابعها لقناة Revision3 . The Digg Reel بودكاست اسبوعي يعرض افضل Digg Video خلال الاسبوعربصورة طريفة بالاضافة إلى افضل التعليقات عليها. TEKZiLLA بودكاست تقنية يومي يعرض العديد من المعلومات والافكار التقنية بالاضافة إلى حلقة اسبوعية طويلة يتم عرض جديد التقنية فيها. FILM RIOT العديد من الافكار والخدع السينمائية وطرق تنفيذها ستتعلمها من هذا البودكاست. ROFL بودكاست اسبوعي يعرض مقاطع من افضل Standup Comedy حول العالم. SCAM School العديد من الخدع وخفة اليد وطرقها موجودها في هذا البودكاست بتقديم رائع. WEB DRIFTER بودكاست غريب يقابل اصحاب المواقع الذين يحملون افكار عجيبة (مجانين ان صحة تسميتهم). ومن خارج قناة Revision3 سأذكر بعض من البودكاست التي أتابعها. Best Of Youtube بودكاست يعرض افضل لمقاطع من اليوتيوب. UNBOXING LIVE بودكاست يستعرض المنتجات الجديدة ومحتوى صناديقها. WIRED gadget lab بودكاست يستعرض المنتجات الجدية ويناقشها. Start Cooking بما اني من محبي الطبخ :) فهذا البودكاست يعرض وصفات وايضاً معلومات وافكار طبخية بصورة جديدة ومبتكرا بخلاف برامج الطبخ المعروفة. بإمكانك الحصول على رابط كل بودكاست في iTunes من خلال الضغط على صورة البودكاست","tags":"misc","title":"بودكاست ١"},{"url":"http://kalua.im/blog/fav-sites-tip.html","text":"الكثير من مستخدمين الانترنت لديهم عدة مواقع يتصفحونها يومياً .. ولتسهيل هذه العملية سأعرض ثلاث طرق الاولى : اضافة Morning Coffee (خاصة بالفايرفوكس) بإستخدام هذه الاضافة يمكنك تعيين المواقع المفضلة اليومية ، بالإضافة الى مواقع مفضلة لأيام محددة ( على سبيل المثال نهاية الاسبوع) . Morning Coffee الثانية : زر الهوم بيج الافتراضي بالمتصفح (تم تجربتها على فايرفوكس و إكسبلورر 8 ) فايرفوكس: يمكنك اضافة اكثر من موقع في خانة (Home page) من خلال فصل الموقع بــ | بدون مسافات (لكتابة الرمز السابق عالي + ) إكسبلورر8 : في خانة (Home page) اضف كل موقع في سطر . الثالثة : مجلد في Toolbar (تم تجربتها على فايرفوكس ، اكسبلورر8 ، سفاري و اوبرا) اضف مجلد في Toolbar وضع بداخلة مواقعك اليومية المفضلة ، ولفتحها جميعا Open All in Tabs","tags":"misc","title":"تلميحة | مواقعك اليومية المفضلة بضغطة زر"},{"url":"http://kalua.im/blog/wordpress-plugins-1.html","text":"في هذه التدوينة أعرض بعض من الإضافات المستخدمة في المدونة بالاضافة الى روابط تحميلها Math Comment Spam Protection تضيف سؤال حسابي للتعليقات لمنع تعليقات السبام المزعجة. مثال من المدونة للتحميل (موقع الاضافة) Page bar يستبدل الانتقال بين الصفحات بشريط يحوي ارقام الصفحات لتسهيل الانتقال بينها. بالامكان التعديل على ملف CSS ليتناسب مع المدونة. مثال من المدونة للتحميل (موقع الاضافة) Contact Coldform نموذج مراسلة للتحميل (موقع الاضافة) php Code Widget يضيف مربعات php في مربعات القائمة الجانبية .. لتتيح لك اضافة اكواد php في القائمة الجانبية للتحميل (موقع الووردبريس)","tags":"misc","title":"إضافات ووردبريس  ١"},{"url":"http://kalua.im/blog/google-logos.html","text":"شعارت قوقل المتجددة من اكثر الامور التي تعجبني بقوقل ، حقيقة ! فكرتها بسيطه جداً ولا تنفعك بالبحث ومع ذلك تجدد بإستمرار وهذا يدل على ان قوقل تهتم باصغر التفاصيل .. لكن هدفنا من هذا البوست هو من يقف خلف هذه الشعارات الرئعة Dennis Hwang \"دينيس هوانج، مشرف على المواقع بشركة Google، هو صاحب فكرة التصميمات الفنية لشعار Google في الصفحة الرئيسية. وقد بدأ دينيس تصميم الـ doodles في عام 2000 حينما بدأ تصميم شعارات تحتفل بالمناسبات العالمية بالإضإفة إلى الأعياد .. للمزيد وللإطلاع على مقابلة نصية مع دينيس \" مقطع يبين المدة التي يستغرقها دينيس وطريقته في التصميم ومن هنا بإمكانك الاطلاع على جميع شعارات قوقل من عام 1999 إلى عامنا هذا","tags":"misc","title":"شعارات قوقل"},{"url":"http://kalua.im/blog/adobe-photoshop-evolution.html","text":"برنامج ادوبي فوتوشوب يعد من افضل برامج تحرير الصور والتصميم - إن لم يكن الأفضل - وكانت بدايته عام 1987 كتطبيق بسيط لنظام الماك بواسطة Thomas Knoll .. وبما يقارب العقدين حصل الفوتوشوب على العديد من التطويرات والاضافات والتعديلات التي اوصلته إلى ماهو عليه الآن .. في هذه التدوينة سنعود إلى الوراء إلى النسخة الاول من البرنامج مروراً بالتطورات التي حصلت عليه الاصدارات الاحداث وصولاً إلى آحدث اصدار من البرنامج Adobe Photoshop CS4 ايقونة البرنامج - Application Icon Adobe Photoshop .63 - 1988 Adobe Photoshop .87 - 1989 Adobe Photoshop 1.0 - 1990 Adobe Photoshop 2.0 - 1993 Adobe Photoshop 2.5 - 1993 Adobe Photoshop 3.0 - 1995 Adobe Photoshop 4.0 - 1996 Adobe Photoshop 5.0 - 1998 Adobe Photoshop 5.5 - 1998 Adobe Photoshop 6.0 - 2000 Adobe Photoshop 7.0 - 2002 Creative Suite 1 - 2003 Creative Suite 2 - 2005 Creative Suite 3 - 2007 Creative Suite 4 - 2009 شاشة الترحيب - Welcome Splash / About Screen Adobe Photoshop .07 - 1988 Adobe Photoshop .63 - 1988 Adobe Photoshop .87 - 1989 Adobe Photoshop 1.0 - 1990 Adobe Photoshop 2.0 - 1993 Adobe Photoshop 2.5 - 1993 Adobe Photoshop 3.0 - 1995 Adobe Photoshop 4.0 - 1996 Adobe Photoshop 5.0 - 1998 Adobe Photoshop 5.5 - 1998 Adobe Photoshop 6.0 - 2000 Adobe Photoshop 7.0 - 2002 Creative Suite 1 - 2003 Creative Suite 2 - 2005 Creative Suite 3 - 2007 Creative Suite 4 - 2009 شريط الأدوات - Toolbars Adobe Photoshop .63 1988 Adobe Photoshop .87 1989 Adobe Photoshop 1.0 1990 Adobe Photoshop 2.0 1993 Adobe Photoshop 2.5 1993 Adobe Photoshop 3.0 1995 Adobe Photoshop 4.0 1998 Adobe Photoshop 5.0 1998 Adobe Photoshop 5.5 1998 Adobe Photoshop 6.0 2000 Adobe Photoshop 7.0 2002 Creative Suite 1 2003 Creative Suite 2 2005 Creative Suite 3 2007 Creative Suite 4 2009 مساحة العمل - Workspace Adobe Photoshop 0.63 - 1988 Adobe Photoshop 1.0 - 1990 Adobe Photoshop 2.5 - 1993 Adobe Photoshop 3.0 - 1995 Adobe Photoshop 4.0 - 1996 Adobe Photoshop 5.0 - 1998 Adobe Photoshop 5.5 - 1998 Adobe Photoshop 6.0 - 2000 Adobe Photoshop 7.0 - 2002 Creative Suite 1 - 2003 Creative Suite 2 - 2005 Creative Suite 3 - 2007 Creative Suite 4 - 2009 المصدر","tags":"misc","title":"تطّور الفوتوشوب  ١٩٨٨ - ٢٠٠٩"},{"url":"http://kalua.im/blog/earth-hour-2009.html","text":"ساعة الارض حدث سنوي عالمي أنشأها الصندوق العالمي للطبيعة ، وفكرة أن يطلب من الأسر والشركات إطفاء الأنوار غير الضرورية والاجهزة الكهربائية لمدة ساعة واحدة لرفع مستوى الوعي تجاه البيئة وما تسببه تلك الاجهزة من اضرار مثل ظاهرة الإحتباس الحراري وغيرها. للمزيد يوم السبت القادم 28 / 3 / 2009 ، الموافق 1 / 4 / 1430 هو اليوم المحدد لهذا الحدث وتكون ساعة الارض من الساعة 8:30 - 9:30 حسب التوقيت المحلي للدولة .. لمزيد من المعلومات وللتسجيل والحصول على بعض الوسائط يمكنك زيارة موقع ساعة الارض .","tags":"misc","title":"ساعة الأرض  ٢٠٠٩"},{"url":"http://kalua.im/blog/tech-tip-1.html","text":"\" تلميحات \" (tips) تصنيف جديد سأعرض فيه تلميحات بسيطة متنوعة .. قد تكون معروفة عند الكثير لكن يغفل عنها الكثير ايضاً .. اضافة مجلدات في شريط الادوات او شريط المفضلة هي تلميحة هذا الموضوع .. تفيد في التنظيم وتسهيل الوصول للمواقع كثيرة الزيارة .. الشرح على متصفح Fire fox .. الخطوات من Book marks اختار Organize Book marks اختر Book marks Toolbar بالضغط على زر الفارة الايمن .. تظهر قائمة اختر منها New Folder اختر اسم للمجلد بعد ذلك اختر Add الان ظهر لنا المجلد في شريط الادوات لإضافة رابط اما عن طريق السحب و الافلات او عن طريق الحفظ المباشر الناتج","tags":"misc","title":"تلميحة | مجلدات في شريط الأدوات بالمتصفح"},{"url":"http://kalua.im/blog/gadgets-sites.html","text":"مواقع الاخبار التقنية او اخبار المنتجات، هي من المواقع التي ازورها يومياً .. هذه مجموعة بسيطة من تلك المواقع 1 Gizmodo 2 Engadget 3 Boing Boing 4 Technabob 5 Gadgets Arabia (عربي)","tags":"misc","title":"مواقعي المفضلة للأخبار التقنية"},{"url":"http://kalua.im/blog/windows-seven.html","text":"خلال الاربع أيام السابقة قمت بتجربة Windows Seven نسخة beta طبعاً .. ومن خلال هذه التدوينة سأسرد تجربتي للنظام الحصول على النظام .. في البداية يجب الحصول على نسخة من النظام وذلك بتحميلها من الصفحة المخصصة لذلك ويجب تسجيل دخول لحسابك للحصول على Product Key .. هناك نسختين وبعدة لغات نسخة ٣٢ بت (وهي التي حملتها) ونسخة ٦٤ بت .. واللغات المتوفرة الانجليزية ، العربية ، الالمانية ، اليابنية والهندية (لنسخة ٣٢ بت فقط) . حجم النسخة قرابة ٢.٤٠ قيقا .. عملية التحميل استغرقت معي قرابة الــ ٦ ساعات .. التحضير لتركيب النظام بعد إنتهاء عملية التحميل تم حرق ملف الــ iso على DVD بعد حرق الــ DVD .. بدأت بتهيئة جهازي الخاص بالتجارب :) .. قمت بستبدال الهارديسك بهارديسك أخر فاضي ليكون خاص بــ ويندوز ٧ مواصفات جهازي المستخدم لتجربة النظام .. المعالج : Dual core 1.8 .. الرام : ٤ قيقا .. الهارديسك: ١٦٠ قيقا .. كرت الشاشة : 256 ميقا تركيب النظام أدخلت الــ DVD اعدادات اللغة والتفضيلات الأخرى ( النسخة التي قمت بتحميلة هي النسخة العربية لكن للا سف لا تدعم الواجهة الانجليزي ) خطوات التركيب تجربة النظام وتنشيطة صورة عامة لسطح المكتب مواصفات جهازي المستخدم لتجربة النظام (يلاحظ في الصورة ان لم اقم بتنشيط النسخة ) تنشيط نسخة النظام (يلاحظ في جميع نوافذ النظام رابط في الأعلى [إرسال الملاحظات] وهو خاصة بمراسلة ميكروسوفت بالمشاكل والإقتراحات للنظام ) تحديث للنظام من الأمور الملاحظ في هذه الإصدار هو التعديل على الـ Task bar وبعد التجربة احسست انه يشبه كثيراً الـ Dock في الماك .. تثبيت برامج على الـ Task bar لتسهيل الوصول إليها ، عند فتح برنامج فإنه يظهر عليه وعند إقفاله يختفي ، البرامج المثبتة عليه تظهر بشكل خاص عند فتحها . عند الوقوف فوق صورة ايقون البرنامج سيظهر إستعراض للنافذة. وفي حالة وجود أكثرمن نافذة ستظهر بجوار بعضها بالإضافة إلى خطوط عمودية تبين وجود اكثر من نافذة .. كما في الصورة. الرموز على الـ Task bar اصبح شكلها اجمل ولها خصائص افضل .. إما *ظهور الرموز والاعلامات* او *إخفائهم* او *ظهور الإعلامات فقط* . خلاصة النظام النظام افضل بكثيرعن سابقه ( فيستا ) وبشكل عام النظام خفيف وسريع وكذلك فيه تحسينات جميلة بالرغم من أن روح الفيستا وشكله موجودة فيه :) .. التجربة كانت سريع ولم أتعمق فيه بشكل كبير .. وهناك امور كثيرة لم استكشفها سأتركها لكم :) .","tags":"misc","title":"تقرير | ويندوز ٧"},{"url":"http://kalua.im/blog/service-sites-1.html","text":"من اروع المواقع التي اضيفها إلى مفضلتي هي المواقع الخدمية ... هذه مجموعة بسيطة من المواقع الخدمية من مفضلتي 1 Photo Funia لإخراج صورتك بطريقة إعلانية رائعة . 2 حوّل لتحويل الملفات إلى معظم الصيغ . 3 User Name Check هل تريد ان يكون لك يوزر نيم موحد لمواقع الويب ٢ .. هذا الموقع يتفحص معظم مواقع الويب ٢ .. كل ما عليك هو ادخال اليوزر نيم لترى المواقع المتوفر بها هذا اليوزر . 4 Feed it قد تعجبك مدونة او موقع وترغب متابعتها من قارئ الخلاصات لكن لم تجد لها رابط .. من خلال هذا الموقع وبإدخالك رابط المدونة او الموقع تحصل على رابط الخلاصات . 5 Round Pic لتدوير أطراف الصورة لتعطيها شكل أجمل . 6 3rbeze للتحويل من طريقة الكتابة العربيزي إلى العربية والعكس .","tags":"misc","title":"مواقع خدمية  ١"},{"url":"http://kalua.im/blog/firefox-addons-2.html","text":"جزء ثاني من سلسلة إضافات الفايرفوكس .. 12 إضافة من تلك الإضافات اللتي تحرق الإكسبلورر :) الجزء الأول 1 DownThemAll ضافة للتحميل ، تعطيك خصائص كثيرة من خصائص برامج التحميل مثل تحميل روابط معينة من الصفحة أو تسلسل في التحميل .. 2 Taboo إضافة جميلة تتيح إضافة الصفحات المؤقتة إلى قائمة لقرأتها مستقبلاً. 3 Magic's Video إضافة لتحميل ملفات الفيديو بصيغة flv مثل اليوتيوب وغيره. 4 gTranslate إضافة الترجمة من موقع قوقل .. كل ما عليك تحديد الكلمة ثم رايت كلك وترجمة. 5 Morning Coffee هناك مواقع نزورها يوميا او ربما في إحدى أيام الأسبوع ، هذا الاضافة تتيح لك إختيار مجموعة من الروابط وتصنيفها على أيام أول كل الأيام .. وبمجرد الضغط على أيقونات الإضافة يتم فتح صفحات ذلك اليوم. 6 Cooliris إضافة تتيح إستعراض الصور أو ملفات الفيديو بطريقة جميلة 7 GoogleTube في أثناء بحثنا في قوقل قد تصادفنا نتائج من اليوتيوب .. هذه الإضافة تقوم بإستعراضها مباشرة. 8 Tab To Window لنقل أو نسخ التاب إلى صفحة جديد. 9 Extended Statusbar لإظهار معلومات أسفل الصفحة .. عدد الصور،الوقت المستغرق لفتح الصفحة وغيرها.. 10 Google Reader Watcher تبحث عن الجديد في القوقل ريدر. 11 Save Session قد تكون لديك صفحات لم تنتهي منها وتريد إستكمالها عن الدخول مرة أخرى على الفايرفوكس .. هذه الإضافة تتيح لك الخروج مع حفظ الصفحات المفتوحة. 12 Fission قد تكون مجرد إضافة شكلية تعطي شريط يبين مدى إكتمال الصفحة ، لكنها جميلة :)","tags":"misc","title":"إضافات الفايرفوكس ٢"},{"url":"http://kalua.im/blog/firefox-addons-1.html","text":"من أفضل المميزات في متصفح الفايرفوكس هي خاصية الإضافات التي من شأنها زيادة الخصائص والوظائف لكثير من الأمور .. فأحببت المشاركة بإضافاتي التي استخدمها معكم .. 1 FireFTP إضافة تتيح لك إدارة ملفات موقعك 2 ColorfulTabs إضافة تلون التاب (tabs) 3 Undo Closed Tabs Button إضافة ترجع التاب الذي تم إغلاقه أخيراً 4 IE Tab بعض المواقع تكون مصممة للمتصفح IE .. فتقوم هذا الاضافة بتحويل قرائتها وكأنك على متصفح IE 5 Pray Times إضافة تقوم بعرض أوقات الصلاة","tags":"misc","title":"إضافات الفايرفوكس ١"},{"url":"http://kalua.im/blog/logos-history.html","text":"شركة قوقل - Google وهذي صفحة البحث عام 1998 شركة كانون - Canon شركة أودبي - Adobe شركة إل جي - LG متصفح الفاير فوكس - Mozilla Firefox شركة موتورلا - Motorola شركة نوكيا - Nokia شركة بالم - Palm شركة زيراكس - Xerox --- المصدر","tags":"misc","title":"تاريخ الشعارات لبعض الشركات العالمية"},{"url":"http://kalua.im/blog/helloworld.html","text":"!Hello world","tags":"misc","title":"أهلاً بالعالم!"}]}